000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаспределениеПоступлений/РаспределениеПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределениеПоступлений</name>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаспределениеПоступлений/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Процедура записывает данные в регистр
//
// Параметры
//	ТаблицаРегистра	- Таблица значений, структура = структура регистра
//
// Возвращаемое значение
//	Нет
//
Процедура ЗаписатьДанныеВРегистр(ТаблицаРегистра) Экспорт
	
	Если ТаблицаРегистра.Количество() > 0 Тогда
				
		Для Каждого СтрокаТаблицыРегистра ИЗ ТаблицаРегистра Цикл
			
				НаборЗаписей = РегистрыСведений.РаспределениеПоступлений.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
				НаборЗаписей.Отбор.НоменклатурнаяГруппа.Установить(СтрокаТаблицыРегистра.НоменклатурнаяГруппа);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				
				Если НЕ СтрокаТаблицыРегистра.Очистить Тогда
					
					ЗаписьРегистра = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаТаблицыРегистра);
					
				КонецЕсли;
				
				НаборЗаписей.Записать(Истина);
				
		КонецЦикла;
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.РаспределениеПоступлений.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
